<?php

/* Шаблон проектирования или паттерн — повторяемая архитектурная конструкция, представляющая собой решение проблемы проектирования в рамках некоторого часто возникающего контекста. Объектно-ориентированные шаблоны показывают отношения и взаимодействия между классами или объектами, без определения того, какие конечные классы или объекты приложения будут использоваться. */



/* Factory */
// Простая Фабрика позволяет сделать централизованное место создания объектов схожего типа.


/* Singleton */
// Одиночка - призван сделать объект единственным экземпляром класса и предоставить единую точку входа.


/* Facade */
// Фасад - позволяет скрыть сложность системы путем сведения всех возможных внешних вызовов к одному объекту, делегирующему их соответствующим объектам системы.


/* Adapter */
// Адаптер - позволяет объектам с несовместимыми интерфейсами работать вместе.


/* Decorator */
// Деоратор - позволяет динамически добавлять объектам новую функциональность, оборачивая их в полезные "обертки".
 